# WireframeBuilder Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WireframeBuilder Members
WireframeBuilder Class Constructors Methods Properties See Also
---
The WireframeBuilder type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| WireframeBuilder | Default constructor. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddCurve | Add a curve to the shape representation stored in this WireframeBuilder. |
| AddPoint | Add a point to the shape representation stored in this WireframeBuilder. |
| Dispose | (Inherited from ShapeBuilder.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Reset | Clears the accumulated geometry. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| ValidateCurve | Validates curve to be added to the wireframe shape being constructed. Used by addCurve to validate input. This function may be used to pre-validate the geometry being added to avoid an exception from AddCurve(). |
| ValidatePoint | Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ShapeBuilder.) |

# See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace